# Brewfile for RetroBat macOS Development Environment
# Install all dependencies with: brew bundle
# See: https://github.com/Homebrew/homebrew-bundle

# Taps (additional package repositories)
# tap "homebrew/cask"
# tap "homebrew/core"

# Development Tools
brew "git"                  # Version control
brew "cmake"                # Build system for C++ projects
brew "pkg-config"           # Helper tool for compiling

# Compression and Download Tools
brew "p7zip"                # 7-Zip compression tool
brew "wget"                 # File downloader
brew "curl"                 # Transfer data with URLs (usually pre-installed)

# Graphics and Media Libraries (for EmulationStation)
brew "sdl2"                 # Simple DirectMedia Layer 2
brew "boost"                # C++ libraries
brew "freeimage"            # Image loading/saving library
brew "freetype"             # Font rendering library
brew "eigen"                # C++ template library for linear algebra

# Additional Libraries
brew "libpng"               # PNG image library
brew "jpeg"                 # JPEG image library

# Optional: SDL3 (when available in Homebrew stable)
# brew "sdl3"               # Simple DirectMedia Layer 3 (for enhanced controller support)

# IDEs and Editors (Casks - GUI applications)
# Uncomment the one you prefer:

# Visual Studio Code (Recommended - Free)
cask "visual-studio-code"

# JetBrains Rider (Commercial - Free for Open Source)
# cask "rider"

# Development SDKs (Casks)
cask "dotnet-sdk"           # .NET SDK for macOS

# Optional: Additional useful tools
# brew "tree"               # Display directory structure
# brew "htop"               # Better top command
# brew "jq"                 # JSON processor

# Mac App Store apps (requires mas-cli)
# Install mas-cli first: brew install mas
# mas "Xcode", id: 497799835
